IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/UART1_1.0.xml
        <register id="UART1_INT_EVENT1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RTOUT" description="Clear UARTOUT Receive Time-Out Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RXINT" description="Clear UART Receive Interrupt." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
    </group>
    <group id="UART1_INT_EVENT2" name="UART1_INT_EVENT2" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UART1_INT_EVENT2_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in UARTRIS and UARTMISC. 15h-1Fh = Reserved" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="TXIFG" value="0xC" description="UART transmit interrupt; Interrupt Flag: TX"/>
            </bitfield>
        </register>
        <register id="UART1_INT_EVENT2_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXINT" description="Enable UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="UART1_INT_EVENT2_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXINT" description="UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="UART1_INT_EVENT2_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXINT" description="Masked UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="UART1_INT_EVENT2_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXINT" description="Set UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="UART1_INT_EVENT2_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="TXINT" description="Clear UART Transmit Interrupt." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
    </group>
    <register id="UART1_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="UART1_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART1_CTL0" width="32" offset="0x1100" description="UART Control Register 0">
        <bitfield id="ENABLE" description="UART Module Enable.  If the UART is disabled in the middle of transmission or reception, it completes the current character before stopping. 
If the ENABLE bit is not set, all registers can still be accessed and updated. It is recommended to setup and change the UART operation mode with having the ENABLE bit cleared to avoid unpredictable behavior during the setup or update.
If disabled the UART module will not send or receive any data and the logic is held in reset state." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Module"/>
            <bitenum id="ENABLE" value="0x1" description="Enable module"/>
        </bitfield>
        <bitfield id="HSE" description="High-Speed Bit Oversampling Enable   #b#NOTE:#/b# The bit oversampling influences the UART baud-rate configuration (see    and   ).  The state of this bit has no effect on clock generation in ISO7816 smart card mode (the SMART bit is set)." begin="16" end="15" width="2" rwaccess="R/W">
            <bitenum id="OVS16" value="0x0" description="16x oversampling."/>
            <bitenum id="OVS8" value="0x1" description="8x oversampling."/>
            <bitenum id="OVS3" value="0x2" description="3x oversampling. It is intended to support 9600 Baud Rate when clock is 32K. IrDA, Manchester and DALI couldnt support when 3x oversampling is enabled."/>
        </bitfield>
        <bitfield id="LBE" description="UART Loop Back Enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Normal operation."/>
            <bitenum id="ENABLE" value="0x1" description="The UARTxTXD path is fed through the UARTxRXD path."/>
        </bitfield>
        <bitfield id="RXE" description="UART Receive Enable  If the UART is disabled in the middle of a receive, it completes the current character before stopping.   #b#NOTE:#/b# To enable reception, the UARTEN bit must be set." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The receive section of the UART is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The receive section of the UART is enabled."/>
        </bitfield>
        <bitfield id="TXE" description="UART Transmit Enable  If the UART is disabled in the middle of a transmission, it completes the current character before stopping.   #b#NOTE:#/b# To enable transmission, the UARTEN bit must be set." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The transmit section of the UART is disabled. The UARTxTXD pin of the UART can be controlled by the TXD_CTL bit when enabled."/>
            <bitenum id="ENABLE" value="0x1" description="The transmit section of the UART is enabled."/>
        </bitfield>
        <bitfield id="RTS" description="Request to Send   
If RTSEN is set the RTS output signals is controlled by the hardware logic using the FIFO fill level or TXDATA buffer. 
If RTSEN is cleared the RTS output is controlled by the RTS bit. The bit is the complement of the UART request to send, RTS modem status output." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Signal not RTS"/>
            <bitenum id="SET" value="0x1" description="Signal RTS"/>
        </bitfield>
        <bitfield id="RTSEN" description="Enable hardware controlled Request to Send" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="RTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="RTS hardware flow control is enabled. Data is only requested (by asserting UARTxRTS) when the receive FIFO has available entries."/>
        </bitfield>
        <bitfield id="CTSEN" description="Enable Clear To Send" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CTS hardware flow control is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="CTS hardware flow control is enabled. Data is only transmitted when the UARTxCTS signal is asserted."/>
        </bitfield>
        <bitfield id="MODE" description="Set the communication mode and protocol used.
(Not defined settings uses the default setting: 0)" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="UART" value="0x0" description="Normal operation"/>
            <bitenum id="RS485" value="0x1" description="RS485 mode: UART needs to be IDLE with receiving data for the in EXTDIR_HOLD set time. EXTDIR_SETUP defines the time the RTS line is set to high before sending. When the buffer is empty the RTS line is set low again. A transmit will be delayed as long the UART is receiving data."/>
            <bitenum id="IDLELINE" value="0x2" description="The UART operates in IDLE Line Mode"/>
            <bitenum id="ADDR9BIT" value="0x3" description="The UART operates in 9 Bit Address mode"/>
            <bitenum id="SMART" value="0x4" description="ISO7816 Smart Card Support  The application must ensure that it sets 8-bit word length (WLEN set to 3h) and even parity (PEN set to 1, EPS set to 1, SPS set to 0) in UARTLCRH when using ISO7816 mode. The value of the STP2 bit in UARTLCRH is ignored and the number of stop bits is forced to 2."/>
            <bitenum id="DALI" value="0x5" description="DALI Mode:"/>
        </bitfield>
        <bitfield id="FEN" description="UART Enable FIFOs" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The FIFOs are disabled (Character mode). The FIFOs become 1-byte-deep holding registers."/>
            <bitenum id="ENABLE" value="0x1" description="The transmit and receive FIFO buffers are enabled (FIFO mode)."/>
        </bitfield>
        <bitfield id="TXD_OUT" description="TXD Pin Control Controls the TXD pin when TXD_OUT_EN = 1 and TXE = 0." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="TXD pin is low"/>
            <bitenum id="HIGH" value="0x1" description="TXD pin is high"/>
        </bitfield>
        <bitfield id="TXD_OUT_EN" description="TXD Pin Control Enable. When the transmit section of the UART is disabled (TXE = 0), the TXD pin can be controlled by the TXD_OUT bit. 
1 = UARTxTXD pin can be controlled by TXD_OUT, if TXE = 0" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="TXD pin can not be controlled by TXD_OUT"/>
            <bitenum id="ENABLE" value="0x1" description="TXD pin can be controlled by TXD_OUT"/>
        </bitfield>
        <bitfield id="MAJVOTE" description="When enabled with oversmapling of 16, samples samples 7, 8, and 9 are majority voted to decide the sampled bit value. The value correspond to al least 2 of the 3 samples is considered to be the received value. In case the 3 values do not match, RIS.NERR bit is set along with RDR.NERR

When enabled with oversmapling of 8, samples samples 3, 4, and 5 are majority voted to decide the sampled bit value. The value correspond to al least 2 of the 3 samples is considered to be the received value. In case the 3 values donot match, RIS.NERR bit is set along with RDR.NERR

